reference-adapter/pspcl-ifix-adapter/src/test/resources/test-data/fetch_pspcl_payment_req.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <GetPayments xmlns="http://tempuri.org/">
            <accountNo>3005754414</accountNo>
        </GetPayments>
    </soap:Body>
</soap:Envelope>